actuator/AC-DBD/old/fluid_case_test/flow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Dielectric Zone
    {
        name    dielSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-10.0 -10.0 0) (10.5 0.0 0.05);
        }
    }
    {
        name    dielectric;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set dielSet;
        }
    }

);

// ************************************************************************* //
